# Асядовский Станислав
print('start code')
books = [
    {
        'title': "Герой нашего времени",
        'author': "Михаил Лермонтов",
        'year': 1840
    },
    {
        'title': "Преступление и наказание",
        'author': "Фёдор Достоевский",
        'year': 1866
    },
    {
        'title': "Мастер и Маргарита",
        'author': "Михаил Булгаков",
        'year': 1967
    },
    {
        'title': "Горе от ума",
        'author': "Александр Грибоедов",
        'year': 1825
    },
    {
        'title': "Судьба человека",
        'author': "Михаил Шолохов",
        'year': 1956
    }
]
for index, book in enumerate(books):
    print(f'---------------------- Книга {index} ----------------------')
    print(f'Название: {book['title']}, Автор: {book['author']}')
    print(f'------------------------- {book['year']} -------------------------')
    print()
print('end code')